#Задача 10: На столе лежат n монеток. Некоторые из них лежат вверх решкой, а некоторые – гербом.
# Определите минимальное число монеток, которые нужно перевернуть, чтобы все монетки были повернуты вверх одной и той же стороной.
# Выведите минимальное количество монет, которые нужно перевернуть

n = int(input('Введите количество монет: '))
num_zero = 0
num_one = 0
for i in range (n):
    count = int(input('Введите если орел - 1, решка - 0: '))
    if count == 0:
        num_zero += 1
    else:
        num_one +=1
if num_zero < num_one:
    print(f"Перевернуть следующее количество монет с решкой: {num_zero}")
else:
    print(f"Перевернуть следующее количество монет с орлом: {num_one}")
