#Задача 12: Петя и Катя – брат и сестра. Петя – студент, а Катя – школьница.
# Петя помогает Кате по математике. Он задумывает два натуральных числа X и Y (X,Y≤1000),
# а Катя должна их отгадать. Для этого Петя делает две подсказки.
# Он называет сумму этих чисел S и их произведение P. Помогите Кате отгадать задуманные Петей числа.

m = int(input('Введите сумму x+y: '))
n = int(input('Введите произведение x*y: '))
for x in range(m):
     for y in range(n):
        if m == x + y and n == x * y:
            print(f'Загаданные числа: x - {x}, y - {y}')